#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-zaJnPCEThhhpzDvG

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.signup: Reading...
data.archive_file.signup: Read complete after 0s [id=cd903f301ee2f4c9f2a9f32ed199b9b188e20ebc]
aws_iam_policy.signup_event_logging: Refreshing state... [id=arn:aws:iam::265390238424:policy/signup_event_logging]
aws_iam_role_policy_attachment.signup_event_lambda_logs: Refreshing state... [id=signup_event_role-20221007041512508800000001]
aws_dynamodb_table.character_info: Refreshing state... [id=character_info]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=habru0]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.signup_event_logging will be destroyed
  # (because aws_iam_policy.signup_event_logging is not in configuration)
  - resource "aws_iam_policy" "signup_event_logging" {
      - arn         = "arn:aws:iam::265390238424:policy/signup_event_logging" -> null
      - description = "IAM policy for logging from a lambda" -> null
      - id          = "arn:aws:iam::265390238424:policy/signup_event_logging" -> null
      - name        = "signup_event_logging" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAT3ST5VLMLBWQ5RNFJ" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_policy.signup_event_policy will be created
  + resource "aws_iam_policy" "signup_event_policy" {
      + arn         = (known after apply)
      + description = "iam policy for signup event lambda"
      + id          = (known after apply)
      + name        = "signup_event_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:BatchGetItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.signup_event_lambda_logs will be destroyed
  # (because aws_iam_role_policy_attachment.signup_event_lambda_logs is not in configuration)
  - resource "aws_iam_role_policy_attachment" "signup_event_lambda_logs" {
      - id         = "signup_event_role-20221007041512508800000001" -> null
      - policy_arn = "arn:aws:iam::265390238424:policy/signup_event_logging" -> null
      - role       = "signup_event_role" -> null
    }

  # aws_iam_role_policy_attachment.signup_event_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "signup_event_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "signup_event_role"
    }

  # aws_lambda_function.signup_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "signup_post_confirmation" {
        id                             = "signup_post_confirmation"
      ~ last_modified                  = "2022-10-07T04:44:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "VGQAf08QwFE6lji9TDFjXe8Dlcmbx2pDWZEtDQHxBiw=" -> "pFrkI/dhMwj+u+eoczYeK8V17Lo04IZCTP+IR2fnskE="
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*